import { HeroTitle } from '@/types/anime.types'

export const carouselData: HeroTitle[] = [
  {
    id: 0,
    slug: 'chainsaw-man',
    title: 'Человек-бензопила Chainsaw man',
    subtitle: 'Озвучка: Каждую неделю',
    description:
      'У Дэндзи  есть мечта — жить мирной и счастливой жизнью, проводя время с любимой девушкой. Однако суровая реальность в лице некоего якудзы заставляет парня вернуться с небес на землю, ведь он вынужден убивать демонов, чтобы расплатиться с необъятными долгами покойного отца. Вместе со своим дьявольским питомцем Почитой, которого использует в качестве оружия, Дэндзи готов сделать что угодно, даже за небольшую плату.',
    img: '/images/chainsaw-man-poster.jpg',
  },
  {
    id: 1,
    slug: 'solo-leveling',
    title: 'Поднятие уровня в одиночку',
    subtitle: 'Озвучка: Каждую неделю',
    description:
      'Десять лет назад по всему миру стали открываться некие «врата», ведущие в подземелья с монстрами, противостоять которым оказалось не под силу даже военным. Однако если успеть вовремя победить босса подземелья, то врата пропадут, не открывшись, и мирные люди не пострадают.',
    img: '/images/solo-leveling.jpg',
  },
  {
    id: 2,
    slug: 'jujutsu-kaisen',
    title: 'Магическая битва: Инцидент в Сибуе',
    subtitle: 'Озвучка: Каждые 2 недели',
    description:
      'Тридцать первое октября 2018 года, район Сибуя. Множество простых людей заключены под магической завесой и взяты в заложники союзом проклятых духов под началом Махито и Гэто. Всех гражданских обещают выпустить невредимыми только с одним условием',
    img: '/images/jujutsu-kaisen.jpg',
  },
]
