import { RecentVoiceover } from '@/types/anime.types'

export const lastDubbingData: RecentVoiceover[] = [
  {
    id: 0,
    slug: 'chainsaw-man',
    title: 'Человек-бензопила',
    description:
      'У Дэндзи есть мечта — жить мирной и счастливой жизнью, проводя время с любимой девушкой. Однако суровая реальность в лице некоего якудзы заставляет парня вернуться с небес на землю, ведь он вынужден убивать демонов, чтобы расплатиться с необъятными долгами покойного отца. Вместе со своим дьявольским питомцем Почитой, которого использует в качестве оружия, Дэндзи готов сделать что угодно, даже за небольшую плату.',
    img: '/images/chainsaw-man-preview.jpg',
    createdAt: new Date(2025, 3, 12).toISOString(),
    episode: 1,
    tags: ['Сенён', '2025'],
  },
  {
    id: 1,
    slug: 'solo-leveling',
    title: 'Поднятие уровня в одиночку',
    description:
      'Десять лет назад по всему миру стали открываться некие «врата», ведущие в подземелья с монстрами, противостоять которым оказалось не под силу даже военным. Однако если успеть вовремя победить босса подземелья, то врата пропадут, не открывшись, и мирные люди не пострадают.',
    img: '/images/solo-leveling-poster-preview.jpg',
    createdAt: new Date(2025, 3, 11).toISOString(),
    episode: 12,
    tags: ['2025', 'Сенён'],
  },
  {
    id: 2,
    slug: 'naruto-shipudden',
    title: 'Наруто: Ураганные хроники',
    description:
      '«Ураганные хроники» продолжают историю о приключениях юного ниндзя Наруто Узумаки и его друзей. С начала серии проходит три года, герои взрослеют, набираются жизненного опыта и совершенствуют свои навыки. Наруто возвращается в Деревню Скрытой Листвы, и команда, ранее состоящая из него, Саскэ  и Сакуры , переформировывается. Место Саскэ в ней занимает молодой ниндзя по имени Сай, и вместе они берут название «Команда Какаши».',
    img: '/images/naruto-shippuden-preview.jpg',
    createdAt: new Date(2025, 3, 10).toISOString(),
    episode: 207,
    tags: ['HD', 'Филлеры', 'Шутор', 'Сенён', 'Топ-5'],
  },
  {
    id: 3,
    slug: 'dandadan',
    title: 'Дандадан',
    description:
      'Хотите узнать, что будет, если взять внучку экстрасенса, неверящую в НЛО, и фаната уфологии, который и думать не желает о призраках? А будет самое настоящее испытание на храбрость или, скорее, испытание верой, во время которого каждый из них захочет показать другому ту сторону реальности, о которой второй даже не задумывался. А вот если эти самые призраки и пришельцы начнут активно на них нападать, то из такого сочетания несочетаемого вполне может получиться достойная команда!',
    img: '/images/dandadan-preview.jpg',
    createdAt: new Date(2025, 3, 9).toISOString(),
    episode: 12,
    tags: ['4K', 'Комедия'],
  },
  {
    id: 4,
    slug: 'metal-alchemist-brotherhood',
    title: 'Стальной алхимик: Братство',
    description:
      'В этом мире существуют алхимики — люди, владеющие искусством алхимии, способностью манипулировать материей и преобразовывать вещество. Все они ограничены основным Законом алхимии: нельзя алхимическим путём получить что-то, не пожертвовав чем-то равноценным полученному. Лишь с помощью легендарного философского камня, способ создания которого утерян, можно обойти этот Закон.',
    img: '/images/metal-alchemist-preview.jpg',
    createdAt: new Date(2025, 3, 8).toISOString(),
    episode: 50,
    tags: ['Топ-10', 'HD'],
  },
]
