import { OngoingTitle } from '@/types/anime.types'

export const ongoingData: OngoingTitle[] = [
  {
    id: 0,
    slug: 'jujutsu-kaisen',
    title: 'Магическая битва 0',
    img: '/images/jujutsu-kaisen-poster.jpg',
    tags: ['1 Сезон', '12 Эпизодов'],
    rating: 4.8,
    description:
      'Много лет назад Юта Оккоцу и его подруга детства Рика Оримото пообещали друг другу, что поженятся, когда вырастут. Однако этому обещанию не суждено было сбыться. Рика трагично погибла в результате дорожно-транспортного происшествия. Всё, что от неё осталось, — старое кольцо и монструозный проклятый дух, преследующий Юту и бесконтрольно уничтожающий его обидчиков. В результате очередной особо жестокой атаки юношу задерживают маги — люди, избавляющие мир от проклятий — и приговаривают к казни из-за необычного уровня силы сопровождающего парня призрака.',
  },
  {
    id: 1,
    slug: 'evil-blade',
    title: 'Клинок зла',
    img: '/images/evil-blade-poster.jpg',
    tags: ['2 Сезон', '24 Эпизода'],
    rating: 6.98,
    description:
      'Двадцать лет назад земли Империи подверглись нападению орд могущественной расы тьмы, прорвавшей магический барьер на границе. Чтобы закрыть прореху в барьере, Император отправил четырнадцать воинов, снабдив их «святыми копьями».',
  },
  {
    id: 2,
    slug: 're-zero-3',
    title: 'Re:Zero. Жизнь с нуля в альтернативном мире 3',
    img: '/images/re-zero-3-poster.jpg',
    tags: ['3 Сезон', '13 Эпизодов'],
    rating: 8.52,
    description:
      'На обратном пути из магазина Субару Нацуки неожиданно призывают в другой мир. Стоит чёрт знает где, самого призывающего ни следа, а на него ещё и нападают! Дело было бы совсем дрянь, если бы не прекрасная сереброволосая дева с пушистым котиком наперевес, которая спасает Субару, после чего тот в благодарность присоединяется к ней. Стоит им найти подсказку — и обоих тут же убивают.',
  },
  {
    id: 3,
    slug: 'kimetsu-no-yaiba',
    title: 'Клинок, рассекающий демонов',
    img: '/images/kimetsu-no-yaiba-poster.jpg',
    tags: ['2 Сезон', '24 Эпизода'],
    rating: 8.44,
    description:
      'Действие происходит в эпоху Тайсё. Ещё с древних времён ходят слухи о том, что в лесу обитают человекоподобные демоны, которые питаются людьми и ходят по ночам, ища новую жертву. Но... это же просто легенда, ведь так?',
  },
  {
    id: 4,
    slug: 'family-spy',
    title: 'Семья шпиона',
    img: '/images/family-spy-poster.jpg',
    tags: ['2 Сезон', '24 Эпизода'],
    rating: 8.82,
    description:
      'Кто приходит на ум, когда речь заходит о тайных агентах? Конечно же, невероятный Джеймс Бонд, который постоянно подвергает жизнь опасности, выполняя секретные миссии. О таком харизматичном и смелом мужчине мечтают многие дамы, так что Агент 007 купается в лучах женского внимания. Герой этой истории, Лойд Форджер, является «Джеймсом Бондом» своего времени. Погони, шпионаж, перестрелки, тайные миссии — всё это является неотъемлемой частью его жизни. Закончив одно задание, он тут же принимается за другое — усталость ему неведома. ',
  },
  {
    id: 5,
    slug: 'bakugan-battle-brawlers',
    title: 'Отчаянные бойцы Бакуган',
    img: '/images/bakugan-battle-brawlers-anime-poster.jpg',
    tags: ['1 Сезон', '170 Эпизодов'],
    rating: 8.93,
    description:
      'Однажды с неба на землю посыпались карты, которые достались детям по всему миру. В этих картах находились монстры разных стихий и способностей. Вскоре шестеро главных героев придумали игру под названием «Бакуган», а потом дополнили её правилами. Вдобавок они назвали свою команду «Отчаянные бойцы бакуган».',
  },
  {
    id: 6,
    slug: 'black-clover',
    title: 'Чёрный клевер',
    img: '/images/black-clover-poster.jpg',
    tags: ['1 Сезон', '52 Эпизода'],
    rating: 8.78,
    description:
      'Ещё детьми Аста и Юно были оставлены у порога церкви в глухой деревушке. Мальчики пообещали друг другу, что один из них станет Королём магов. Однако чем старше они становились, тем больше различий между ними появлялось. Юно был гением магии, а Аста тренировал своё тело лишь физически. Когда им исполнилось по 15 лет, пришло время получать гримуары. Юно стал обладателем книги с четырёхлистным клевером (большинство людей получают книги с трёхлистным), в то время как Аста не получил ничего.',
  },
]
